const name = ['LINDA', '出水芙蓉', '薇薇安', '李IOY', '依一', '皮皮', '傻傻的童花头', '天街小雨🍀', 'NINA', '米花糖', '水云轩', '木棉花', '贝贝', 'Sandy', '未来', '星空', '晓姓夜宿', '岳岳妈', 'ELLA', '君', '阳光灿烂', '随心', 'Daz', '极光', '欢欢', 'lucky', 'tony', '春夏', '万物小可爱', '随意', '一叶知秋']
const ar = ['6.6元新春红包', '8.8元新春红包', '6.6元新春红包', '8.8元新春红包', '66元新春红包', '88元新春红包', '《小猪佩奇》家庭套票一组', '8.8元新春红包', '故宫文创大礼包', '星巴克猪年限定随行杯套装', '666元新春红包']

export default () => {
    const list = []
    name.forEach((item, idx) => Math.floor(Math.random() * 2) && list.push(`${item}抽中了${ar[(idx * 27 + 3) % 11]}；`))
    return [].concat(list, list)
}
